ConnectionService/examples/nsi_cs_2.1_section_19.6_figure_149_modifyCapacity.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:headers="http://schemas.ogf.org/nsi/2013/12/framework/headers" 
        xmlns:p2p="http://schemas.ogf.org/nsi/2013/12/services/point2point" 
        xmlns:nsi="http://schemas.ogf.org/nsi/2013/12/connection/types"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="
        http://schemas.xmlsoap.org/soap/envelope/ file:../envelope.xsd
        http://schemas.ogf.org/nsi/2013/12/connection/types file:../ogf_nsi_connection_types_v2_0.xsd
        http://schemas.ogf.org/nsi/2013/12/framework/types file:../ogf_nsi_framework_types_v2_0.xsd">
    <soapenv:Header>
        <headers:nsiHeader>
            <protocolVersion>application/vnd.ogf.nsi.cs.v2.provider+soap</protocolVersion>
            <correlationId>urn:uuid:390be79e-5b49-4688-9280-e49b139595e2</correlationId>
            <requesterNSA>urn:ogf:network:es.net:2013:nsa:nsi-requester</requesterNSA>
            <providerNSA>urn:ogf:network:es.net:2013:nsa:nsi-aggr-west</providerNSA>
            <replyTo>https://nsi-aggr-west.es.net/requester/reply</replyTo>
        </headers:nsiHeader>
    </soapenv:Header>
    <soapenv:Body>
        <nsi:reserve>
            <connectionId>urn:uuid:4b4a71d0-3c71-47cf-a646-beacb14a4c72</connectionId>
            <criteria version="2">
                <p2p:capacity>500</p2p:capacity>
            </criteria>
        </nsi:reserve>
    </soapenv:Body>
</soapenv:Envelope>
